{
  "home": {
    "title": "Éric Vitor",
    "text": "Full-Stack Developer"
  },
  "about": {
    "title": "About Me",
    "text": "I am a passionate software developer with experience in building web applications using modern technologies."
  },
  "projects": {
    "repository": "Repository",
    "see": "Project",
    "title": "Projects",
    "reduxView": {
      "title": "Redux-Visualizer",
      "text": "Redux Visualizer is a React component in modal form that allows you to inspect, expand, and edit Redux states in real time. It displays the state as an interactive tree and offers full support for editing values of any type, making the debugging and visualization process simpler and more intuitive.\n\nTechnologies used: JavaScript, TypeScript, Redux, Vite, Css, NPM"
    },
    "coap": {
      "title": "COAP",
      "text": "COAP is a drag-and-drop visual tool for creating educational content, similar to Canva or Wix, but specifically focused on teaching materials. With an intuitive interface, it allows educators, instructional designers, and content creators to quickly assemble interactive materials without the need for technical knowledge."
    },
    "customDeploy": {
      "title": "Custom Deploy",
      "text": "CustomDeploy is a complete solution for automating the deployment of web applications and APIs hosted on IIS, integrating a robust backend in .NET 8 and a modern frontend in React + TypeScript. The system allows managing publications, authentication, and centralized permissions."
    },
    "netcoreStarter": {
      "title": "NetCore Api StarterPack",
      "text": "API in ASP.NET Core 8.0 designed as a starting point for any project that needs the basics:\n✅ JWT Authentication\n✅ Secrets Management (User Secrets / Docker Secrets)\n✅ Localizer ready for multiple languages\n✅ Complete test structure (unit, integration, and contract)\n✅ Docker ready for production"
    },
    "graphQLAPI": {
        "title": "GraphQLAPI",
        "text": ".NET API focused exclusively on GraphQL, using HotChocolate and EF Core.\n\nTechnologies used: C#, GraphQL, EntityFramework, SQL"
      }
  },
  "navigation": {
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "projects": "Projects",
    "contact": "Contact"
  },
  "theme": {
    "theme": "Theme",
    "Default": "Default",
    "LiquidGlass": "Liquid Glass"
  },
  "modal": {
    "close": "Close"
  },
  "header": {
    "settings": "Settings",
    "reactScan": "React Scan",
    "reduxVisualizer": "Redux Visualizer"
  },
  "language": {
    "switch": "Switch language"
  },
  "footer": {
    "rights": "All rights reserved",
    "privacy": "Privacy",
    "terms": "Terms",
    "contact": "Contact"
  },
  "skills": {
    "title": "Skills",
    "react": {
      "title": "React",
      "text": "Solid experience in developing modern applications using React.js, focusing on performance, componentization, and best architecture practices."
    },
    "reactNative": {
      "title": "React Native",
      "text": "Development of cross-platform mobile apps with React Native, ensuring high performance and integration with native features."
    },
    "apis": {
      "title": "APIs & Backend",
      "text": "Creation of scalable and secure RESTful APIs, integrating systems and ensuring efficient communication between services."
    },
    "devops": {
      "title": "Infra & DevOps",
      "text": "Experience with automation, continuous integration, and cloud deployment, ensuring scalability and high availability."
    }
  }
}
