{
  "home": {
    "title": "Éric Vitor",
    "text": "Desenvolvedor Full-Stack"
  },
  "about": {
    "title": "Sobre mim",
    "text": "Desenvolvedor Full-Stack com experiência desde 2018 em projetos web e mobile, atuando com React, React Native, TypeScript, C# e ASP.NET Core. Especialista em arquiteturas modernas, como monorepos e desenvolvimento orientado a componentes, além de APIs RESTful."
  },
  "projects": {
    "repository": "Repositório",
    "see": "Projeto",
    "title": "Projetos",
    "reduxView": {
      "title": "Redux-Visualizer",
      "text": "Redux Visualizer é um componente React em forma de modal que permite inspecionar, expandir e editar estados do Redux em tempo real. Ele exibe o estado como uma árvore interativa e oferece suporte completo para edição de valores de qualquer tipo, tornando o processo de debug e visualização mais simples e intuitivo.\n\nTecnologias usadas: JavaScript, TypeScript, Redux, Vite, Css, NPM"
    },
    "coap": {
      "title": "COAP",
      "text": "O Coap é uma ferramenta visual drag-and-drop para criação de conteúdos educacionais, similar ao Canva ou Wix, mas focada especificamente em materiais didáticos. Com uma interface intuitiva, permite que educadores, designers instrucionais e criadores de conteúdo montem rapidamente materiais interativos sem necessidade de conhecimento técnico."
    },
    "customDeploy": {
      "title": "Custom Deploy",
      "text": "CustomDeploy é uma solução completa para automação de deploys de aplicações web e APIs hospedadas no IIS, integrando backend robusto em .NET 8 e frontend moderno em React + TypeScript. O sistema permite gerenciar publicações, autenticação, permissões centralizadas."
    },
    "netcoreStarter": {
      "title": "NetCore Api StarterPack",
      "text": "API em ASP.NET Core 8.0 pensada como ponto de partida para qualquer projeto que precise do “arroz com feijão”:\n✅ Autenticação JWT\n✅ Gerenciamento de Secrets (User Secrets / Docker Secrets)\n✅ Localizer pronto para múltiplos idiomas\n✅ Estrutura de testes completa (unit, integration e contract)\n✅ Docker pronto para produção"
    },
    "graphQLAPI": {
      "title": "GraphQLAPI",
      "text": "API .NET focada exclusivamente em GraphQL, utilizando HotChocolate e EF Core.\n\nTecnologias usadas: C#, GraphQL, EntityFramework, SQL"
    }
  },
  "navigation": {
    "home": "Início",
    "about": "Sobre",
    "skills": "Habilidades",
    "projects": "Projetos",
    "contact": "Contato"
  },
  "theme": {
    "theme": "Tema",
    "Default": "Padrão",
    "LiquidGlass": "Liquid Glass"
  },
  "modal": {
    "close": "Fechar"
  },
  "header": {
    "settings": "Configurações",
    "reactScan": "React Scan",
    "reduxVisualizer": "Redux Visualizer"
  },
  "language": {
    "switch": "Alternar idioma"
  },
  "footer": {
    "rights": "Todos os direitos reservados",
    "privacy": "Privacidade",
    "terms": "Termos",
    "contact": "Contato"
  },
  "skills": {
    "title": "Habilidades",
    "react": {
      "title": "React",
      "text": "Experiência sólida no desenvolvimento de aplicações modernas utilizando React.js, com foco em performance, componentização e boas práticas de arquitetura."
    },
    "reactNative": {
      "title": "React Native",
      "text": "Desenvolvimento de aplicativos móveis multiplataforma com React Native, garantindo alta performance e integração com recursos nativos."
    },
    "apis": {
      "title": "APIs & Backend",
      "text": "Criação de APIs RESTful escaláveis e seguras, integrando sistemas e garantindo eficiência na comunicação entre serviços."
    },
    "devops": {
      "title": "Infra & DevOps",
      "text": "Experiência com automação, integração contínua e deploy em nuvem, garantindo escalabilidade e alta disponibilidade."
    }
  }
}
